# Завдання 3: Користування інкапсуляцією та абстракцією у реальному коді
#
# Розгляньте фрагмент коду з існуючого проекту або бібліотеки та ідентифікуйте в ньому використання інкапсуляції
# та абстракції. Поясніть, як вони застосовуються і як це допомагає поліпшити читабельність та підтримку коду.
#



# Відповідь:

# У бібліотеках типу requests:
#
# Інкапсуляція: Об’єкт Response має приватні поля (наприклад, _content), а доступ до даних надається через методи
# чи властивості (.text, .json()).
# Абстракція: Користувач викликає requests.get(), не знаючи, як саме відбувається HTTP-запит — це приховано в реалізації.
